<h1>Universit&eacute; Lille 1 - Conception d'Applications R&eacute;parties (CAR) - TD/TP Groupe 2</h1>
<h2>Informations g&eacute;n&eacute;rales</h2>
<h3>Liens utiles</h3>
<ul>
    <li>Lien vers la <a href="http://www.fil.univ-lille1.fr/portail/index.php?dipl=MInfo&amp;sem=S8&amp;ue=CAR&amp;label=P" target="_blank" rel="noopener">page de pr&eacute;sentation g&eacute;n&eacute;rale du cours</a></li>
    <li>Liens vers <a href="http://moodle.univ-lille1.fr/course/view.php?id=346" target="_blank" rel="noopener">les documents associ&eacute;s (cours, TDs, TPs) et les consignes des TPs</a> <strong>(n&eacute;cessite une inscription)</strong></li>
</ul>
<h3>Evaluation des TPs</h3>
<h4>Proc&eacute;dure</h4>
<p>Chaque TP est &eacute;valu&eacute; en deux temps :</p>
<ol>
    <li><strong>Ensemble</strong>, pour v&eacute;rifier la bonne ex&eacute;cution de votre programme. Evaluation <em>live</em>.</li>
    <li><strong>Apr&egrave;s coup</strong>, pour analyser le code, les ressources et la structure de votre projet. Evaluation <em>statique</em>.</li>
</ol>
<p>Pour cela :</p>
<ul>
    <li>Pour les &eacute;valuations <em>lives</em>&nbsp;:
        <ul>
            <li>Elles auront lieu&nbsp;<strong>&agrave; chaque d&eacute;but de s&eacute;ance du TP suivant</strong> (sauf le dernier TP o&ugrave; l'&eacute;valuation sera faite en derni&egrave;re s&eacute;ance).</li>
            <li>Le programme devra &ecirc;tre&nbsp;<strong>op&eacute;rationnel sur les machines de l'&eacute;tablissement</strong>.</li>
            <li>Bien &eacute;videmment, <strong>la pr&eacute;sence est obligatoire</strong>.</li>
        </ul>
    </li>
    <li>Pour les &eacute;valuations <em>statiques</em>&nbsp;:
        <ul>
            <li>Elles auront lieu <strong>la veille de l'&eacute;valuation <em>live</em>, &agrave; 20h00</strong>.</li>
            <li>La r&eacute;cup&eacute;ration est automatique, ainsi : <strong>aucune autre version des sources ne sera accept&eacute;e pass&eacute; cette date</strong>.</li>
            <li>Bien &eacute;videmment, <strong>tout plagiat donnera lieu &agrave; un 0</strong> (sans compter l'&eacute;criture d'un rapport au responsable de l'UE, qui lui m&ecirc;me en fera part aux membres du jury).</li>
        </ul>
    </li>
</ul>
<p>Ces deux &eacute;valuations constituent ainsi la note finale du TP.</p>
<h4>Dates de rendus</h4>
<p>Ci-apr&egrave;s les dates de rendus pour les TPs :</p>
<table style="border-color: #A7A7A7; border-collapse: collapse;" border="1px solid rgb(167, 171, 196)">
    <tbody>
    <tr>
        <td style="border: 1px solid #A7ABC4;">&nbsp;</td>
        <td style="border: 1px solid #a7abc4; text-align: center;">Evaluation <em>statique</em></td>
        <td style="border: 1px solid #a7abc4; text-align: center;">Evaluation <em>live</em></td>
    </tr>
    <tr>
        <td style="border: 1px solid #A7ABC4;">TP 1 - Serveur FTP</td>
        <td style="border: 1px solid #A7ABC4;">Mardi 20/02/2018, 8h</td>
        <td style="border: 1px solid #A7ABC4;">Mardi 20/02/2018</td>
    </tr>
    <tr>
        <td style="border: 1px solid #A7ABC4;">TP 2 - Passerelle REST</td>
        <td style="border: 1px solid #A7ABC4;">Mardi 20/03/2018, 8h00</td>
        <td style="border: 1px solid #A7ABC4;">Mardi 20/03/2018</td>
    </tr>
    <tr>
        <td style="border: 1px solid #A7ABC4;">TP 3 - Akka - Transfert de donn&eacute;es</td>
        <td style="border: 1px solid #A7ABC4;">Mardi 03/04/2018, 8h00</td>
        <td style="border: 1px solid #A7ABC4;">Mardi 03/04/2018</td>
    </tr>
    <tr>
        <td style="border: 1px solid #A7ABC4;">TP 4 - Java EE</td>
        <td style="border: 1px solid #A7ABC4;">Mardi 17/04/2018, 8h00</td>
        <td style="border: 1px solid #A7ABC4;">Mardi 17/04/2018</td>
    </tr>
    </tbody>
</table>
<h2>Informations suppl&eacute;mentaires</h2>
<h3>TP 1 - Serveur FTP</h3>
<h4>M&eacute;thodologie de d&eacute;veloppement</h4>
<p>Ci-apr&egrave;s une proposition de m&eacute;thodologie pour vous aider &agrave; la r&eacute;alisation de ce TP :</p>
<ol>
    <li><strong>Lire les instructions du TP</strong><br />Ne pas se fier au nom de classes ni &agrave; l'architecture impos&eacute;s dans l'ennonc&eacute;. Vous &ecirc;tes libres de choisir vos noms de classes et l'architecture qui vous va le mieux. Le but &eacute;tant d'obtenir une architecture la plus &eacute;l&eacute;gante possible. L'utilisation de <a href="https://en.wikipedia.org/wiki/Design_Patterns" target="_blank" rel="noopener">design patterns</a> est <strong>tr&egrave;s</strong> recommand&eacute;e (rappelez-vous de votre cours de <a href="http://portail.fil.univ-lille1.fr/portail/index.php?dipl=L&amp;sem=S5&amp;ue=COO&amp;label=Pr%C3%A9sentation" target="_blank" rel="noopener">Conception Orient&eacute;e Objet</a> en L3). Notez que <strong>dans tous les cas</strong>, une documentation de l'architecture et des classes associ&eacute;es deva &ecirc;tre produite (cf.&nbsp;<a href="http://moodle.univ-lille1.fr/course/view.php?id=346" target="_blank" rel="noopener">consignes g&eacute;n&eacute;rales des TPs</a>).</li>
    <li><strong>Lire la liste des exigences du TP</strong><br />Attention : certaines commandes suppl&eacute;mentaires non inscrites sur les instructions du TP devront &ecirc;tre ajout&eacute;es pour respecter l'ensemble des exigences. De plus, certaines extensions ont &eacute;t&eacute; ajout&eacute;es depuis l'&eacute;criture de la RFC, notamment la compatibilit&eacute; de certaines commandes avec l'adressage <a href="https://en.wikipedia.org/wiki/IPv6_address">IPv6</a>. (cf.&nbsp;<a href="#tp1-live-eval-note">note sur l'&eacute;valution <em>live</em></a>)</li>
    <li><strong>Lire la page <a href="https://fr.wikipedia.org/wiki/File_Transfer_Protocol">Wikipédia (FR)</a></strong>
        <ol>Elle offre une première compréhension du protocol FTP. Cependant elle n'est pas asser exhaustive pour suffire. Il faut (et vous devez) compléter vos connaissances en lisant la RFC.</ol>
    </li>
    <li><strong>Lire la RFC</strong>
        <ol>
            <li>En connaissant au pr&eacute;alable les <a href="https://www.ietf.org/rfc/rfc2119.txt" target="_blank" rel="noopener">notions d'exigences</a> lorsque l'on lit une RFC (mots cl&eacute;s <em>MUST</em>, <em>SHOULD</em>, <em>MAY</em>)</li>
            <li>En connaissant au pr&eacute;alable le protocole TCP/IP et <a href="https://tools.ietf.org/rfc/rfc854.txt" target="_blank" rel="noopener">la syntaxe associ&eacute;e au protocole Telnet</a></li>
            <li>En se basant sur les instructions et la liste des exigences du TP, et ainsi, en ne <strong>s&eacute;lectionnant qu'uniquement ce qui est n&eacute;cessaire</strong> pour le d&eacute;veloppement de celui-ci (il ne s'agit pas d'impl&eacute;menter la totalit&eacute; de la RFC)</li>
            <li>En partageant sa vision avec les autres membres du groupes afin de v&eacute;rifier que :
                <ol>
                    <li>Le mod&egrave;le FTP est bien compris</li>
                    <li>Les diff&eacute;rentes notions FTP sont bien comprises (types de donn&eacute;es, connexion de commandes/donn&eacute;es, format de r&eacute;ponse...)</li>
                </ol>
            </li>
        </ol>
    </li>
    <li><strong>Concevoir l'impl&eacute;mentation</strong>
        <ol>
            <li>En se basant sur les sp&eacute;cifications (instructions et liste des exigences) du TP</li>
            <li>En r&eacute;alisant les sch&eacute;mas n&eacute;cessaires &agrave; votre conception (diagrammes cas d'utilisation, classes, s&eacute;quences...)</li>
        </ol>
    </li>
    <li><strong>D&eacute;velopper l'impl&eacute;mentation</strong>
        <ol>
            <li>En d&eacute;finissant le squelette de votre mod&egrave;le</li>
            <li>En suivant une d&eacute;marche de d&eacute;veloppement (<em>e.g.,</em> <a href="https://en.wikipedia.org/wiki/Test-driven_development" target="_blank" rel="noopener">TDD</a>). N'oubliez pas dans ce cas de pr&eacute;ciser votre m&eacute;thodologie au sein de votre <em>README.md</em>.</li>
            <li>En se basant sur des outils facilitant votre d&eacute;veloppement :
                <ol>
                    <li>En respectant les outils impos&eacute;s :
                        <ol>
                            <li>Maven</li>
                            <li><a href="http://gitlab-etu.fil.univ-lille1.fr" target="_blank" rel="noopener">Gitlab</a></li>
                        </ol>
                    </li>
                    <li>En ajoutant des outils suppl&eacute;mentaires de votre choix. Dans ce cas vous devrez justifier leurs utilisations au sein de votre <em>README.md</em>.</li>
                </ol>
            </li>
        </ol>
    </li>
</ol>
<h4 id="tp1-live-eval-note">Note au sujet de l'&eacute;valuation <em>live</em></h4>
<p>L'&eacute;valuation <em>live</em> se fera avec le programme FTP client&nbsp;<strong>ftp</strong>, pr&eacute;-install&eacute; sur vos machines. Veillez &agrave; bien v&eacute;rifier le fonctionnement de votre serveur avec ce client (notamment la compatibilit&eacute; avec l'adressage IPv6 non pr&eacute;sent dans la version de votre RFC).</p>
<h3>Acknowledgement to Aurelien Bourdon</h3>